{"title":"Hello","content":"This post is written in the balcony of jsCafe on 4th of May 2017. \r\nThe sun is shining and it's the second warm day this year.\r\nHello world.","titles":"{&quot;title&quot;:&quot;Title&quot;,&quot;content&quot;:&quot;Content&quot;,&quot;image&quot;:&quot;Photo 1&quot;}","objectId":"gueHhAepw7","_id":"PqNbC6TCgw0jai4c"}
{"title":"Second post","content":"This is written on the next evening. Here we needed at least two lines of data in the database to show the possibilities of admin page. Today the sunset has already passed and so has today really. It's 00.18 at night and it was a good day today (calendar-man would say yesterday). It was the third warm day this year. And here I am writing this in a 100px wide autoresizing textarea. ","titles":"{&quot;title&quot;:&quot;Title&quot;,&quot;content&quot;:&quot;Content&quot;,&quot;image&quot;:&quot;Photo 1&quot;}","objectId":"e8uU5H6NFh","_id":"WaX4d71vNxCeI4CC"}
{"title":"About using node-jay with nedb in Heroku, Docker &amp; Dokku / III post","content":"So it's the third day now. Still blue sky and warm spring winds. In Estonia we've been waiting for this the whole Winter. I uploaded this code to Heroku now and the expected result followed. <br /><br />Heroku plays this just fine, but I've got to keep in mind that Heroku and such have a <i>ephemerical</i> file system, which means that the server gets restarted about once every 24 hours and all the files reset to the way they were in git. <br /><br />Since our database is also just a file, then this affects greatly our database - the database will also be restarted with the rest of the server. <br /><br />Since I'm currently mainly using Jay-Node for prototyping I don't mind so much but when I start (to worry about this), I will rewrite the Jay Nedb wrapper to also work with Mongo, since the API _should_ be pretty much the same.<br /><br />Have an awesome Friday! ","titles":"{&quot;title&quot;:&quot;Title&quot;,&quot;content&quot;:&quot;Content&quot;,&quot;image&quot;:&quot;Photo 1&quot;}","objectId":"kJRwpLL9Fq","_id":"nxQFBydQ8AzuLdlO"}
